ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q     = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        $data  = [
            'title'     => $title,
            'q'         => $q,
            'artikel'   => $model->paginate(10), #data dibatasi 10 record per halaman
            'pager'     => $model->pager,
        ];

INSERT INTO `artikel` (`judul`, `isi`, `slug`, `gambar`) VALUES ('Testtt', 'Praktikum terakhir \r\n', 'Testtt', 'WhatsApp Image 2021-08-29 at 13.52.41.jpeg')
---
    public function add()
    {
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid)
        {
            $file = $this->request->getFile('gambar');
            $file->move(ROOTPATH . 'public/gambar');

            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul'     => $this->request->getPost('judul'),
                'isi'       => $this->request->getPost('isi'),
                'slug'      => url_title($this->request->getPost('judul')),
                'gambar'    => $file->getName(),
            ]);